{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMxW4ULp95mTkZHYHDYg6tc"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["Скрипт по преобразованию данных.  Из входных данных в xlsx файле, в котором данные следуют не на границу месяца, с перерывами и переменным периодом, используя линейную интерполяцию по двум соседним точкам создает файл, в которм данные слейдуют с шагом в 1 месяц на первое число, каждого месяца. \n","Входные данные должны  быть на листе с именем \"Лист1\",  \n","\n","в переменную date - записать название столбца с датой\n","в переменную value - название столбца с данными \n","\n","Реззультат будет записан в файл \n","output_file_path = 'interpolated_data.xls'"],"metadata":{"id":"O5T0fnmgNxp9"}},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hRNuAOu2Je6h","executionInfo":{"status":"ok","timestamp":1680442688645,"user_tz":-420,"elapsed":525,"user":{"displayName":"dimamarareskul","userId":"10239391957467881463"}},"outputId":"19cfa43b-a561-4b9f-effb-e00aaf9982a2"},"outputs":[{"output_type":"stream","name":"stdout","text":["Данные успешно интерполированы и сохранены в файле interpolated_data.xls\n"]}],"source":["import pandas as pd\n","import numpy as np\n","from datetime import timedelta\n","from openpyxl import load_workbook\n","\n","# Чтение данных из файла\n","file_path = 'ВВП.xlsx'\n","date='Дата'\n","value='ВВП'\n","df = pd.read_excel(file_path, sheet_name='Лист1', parse_dates=[date])\n","\n","# Создание списка с датами с шагом в месяц\n","start_date = df[date].min().replace(day=1)\n","end_date = df[date].max().replace(day=1)\n","month_range = pd.date_range(start_date, end_date, freq='MS')\n","\n","# Линейная интерполяция данных\n","interpolated_data = []\n","for target_date in month_range:\n","    # Найти ближайшие точки слева и справа от целевой даты\n","    left_point = df[df[date] <= target_date].iloc[-1]\n","    right_point = df[df[date] >= target_date].iloc[0]\n","\n","    if left_point[date] == right_point[date]:\n","        interpolated_value = left_point[value]\n","    else:\n","        # Рассчитать веса для интерполяции\n","        left_weight = (right_point[date] - target_date) / (right_point[date] - left_point[date])\n","        right_weight = 1 - left_weight\n","\n","        # Рассчитать интерполированное значение\n","        interpolated_value = left_weight * left_point[value] + right_weight * right_point[value]\n","\n","    interpolated_data.append([target_date, interpolated_value])\n","\n","# Создание нового DataFrame\n","df_interpolated = pd.DataFrame(interpolated_data, columns=[date, value])\n","\n","# Запись нового листа в файл\n","output_file_path = 'interpolated_data.xls'\n","with pd.ExcelWriter(output_file_path, engine='openpyxl', mode='w') as writer:\n","    df_interpolated.to_excel(writer, sheet_name='Лист1', index=False)\n","\n","print(\"Данные успешно интерполированы и сохранены в файле\", output_file_path)"]}]}